#include <stdio.h>
#include <stdlib.h>
#define N 5
int arr[2 * N + 1] = { 3,5,1,8,0,6,2,10,7,4,9 };

int main() {
    int i, j, ia, a, ia1, a1;
    ia = -1;
    for (i = 0; i <= N; i++) { // N+1 раз ищем последовательные максимумы
        ia1 = -1;
        for (j = 0; j < 2 * N + 1; j++) {
            if (ia1 == -1) { // нет кандидата на максимум
                if (ia == -1) { // нет найденных максимумов
                    ia1 = j;
                    a1 = arr[j];
                }
                else { // надо проверять на найденный максимум
                    if (arr[j] < a) {
                        ia1 = j;
                        a1 = arr[j];
                    }
                }
            }
            else { // есть кандидат на максимум
                if (ia == -1) { // нет найденных максимумов
                    if (arr[j] > a1) {
                        ia1 = j;
                        a1 = arr[j];
                    }
                }
                else { // надо проверять на найденный максимум
                    if (arr[j] > a1 && arr[j] < a) {
                        ia1 = j;
                        a1 = arr[j];
                    }
                }
            }
        }
        ia = ia1; // индекс очередного максимума
        a = a1;   // очередной максимум
    }
    printf("%d %d\n", ia, a);
    return 0;
}